#3. По введенным пользователем координатам двух точек вывести уравнение прямой вида y = kx + b,
# проходящей через эти точки
"""
print("Введите координаты первой точки K(x1;y1):")
x1 = int(input("x1 = "))
y1 = int(input("y1 = "))

print("Введите координаты второй точки M(x2;y2):")
x2 = int(input("x2 = "))
y2 = int(input("y2 = "))

k = int((y1 - y2) / (x1 - x2))
b = int(y2 - k * x2)
print(" y = %.2f * x + %.2f" % (k, b))

"""
print("Введите координаты первой точки K(x1;y1):")
x1 = int(input("x1 = "))
y1 = int(input("y1 = "))

print("Введите координаты второй точки M(x2;y2):")
x2 = int(input("x2 = "))
y2 = int(input("y2 = "))

if x1 == x2:
    print("х1 = х2 =  %.2f" % (x1))
else:
    k = int((y1 - y2) / (x1 - x2))
    b = int(y2 - k * x2)
    print(" y = %.2f*x + %.2f" % (k, b))

